const initial = {
  courseList: [
    {
      id: 1,
      title: "پایتون",
      describe:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است",
      img: "../assets/machinlearning-a.jpg",
    },
    {
      id: 2,
      title: "ریاضی ماشین لرنینگ",
      describe:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است",
      img: "../assets/mathMachineLearning.jpeg",
    },
    {
      id: "3",
      title: "الگوریتم و ساختمان داده",
      describe:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است",
      img: "../assets/machineLearning-b.jpg",
    },

    {
      id: "4",
      title: "ماشین لرنینگ مقدماتی",
      describe:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است",
      img: "../assets/machineLearning-d.jpg",
    },

    {
      id: "5",
      title: "ماشین لرنینگ پیشرفته",
      describe:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است",
      img: "../assets/proMachinelearning.webp",
    },

    {
      id: "6",
      title: "آمار و احتمالات",
      describe:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است",
    },
  ],
};

export const coursesReducer = (state = initial, { type, payload }) => {
  switch (type) {
    case "all":
      return state;
    default:
      return state;
  }
};
